Conf.Simple/src/InformationRegisters/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена</name>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_full</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_base64</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>hash_owner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode_owner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_property</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>series_number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>hash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СброситьПризнакОбработки(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("sid_doc", ТекДанные.sid_doc);
	Контекст.Вставить("hash", ТекДанные.hash);
	Контекст.Вставить("barcode", ТекДанные.barcode);
	
	Оповещение = Новый ОписаниеОповещения("СброситьПризнакОбработкиПослеВыбораПоПолю", ЭтотОбъект, Контекст);
	
	Если Не ТекДанные.Обработано Тогда
		
		ТекстВопроса = НСтр("ru = 'Текущий отсканированный штрихкод еще не был обработан.
		|Сбросить признак обработки у всех отсканированных штрихкодов по документу обмена (%1)?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.sid_doc);
		
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить("ПоДокументуОбмена", НСтр("ru = 'Да'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
	Иначе
		
		ТекстВопроса = НСтр("ru = 'Сбросить признак обработки у всех отсканированных штрихкодов по документу обмена (%1) или по штрихкоду (%2)?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.sid_doc, ТекДанные.barcode);
		
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить("ПоДокументуОбмена", НСтр("ru = 'По документу обмена'"));
		Кнопки.Добавить("ПоШтрихкоду", НСтр("ru = 'По штрихкоду'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
	КонецЕсли;
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , , НСтр("ru = 'Сброс признака обработки'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СброситьПризнакОбработкиПослеВыбораПоПолю(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("ВидСброса", Ответ);
	
	ПараметрыСбросаПризнакаОбработки = Новый Структура();
	ПараметрыСбросаПризнакаОбработки.Вставить("sid_doc", Контекст.sid_doc);
	
	Если Ответ = "ПоШтрихкоду" Тогда
		ПараметрыСбросаПризнакаОбработки.Вставить("hash", Контекст.hash);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СброситьПризнакОбработкиЗавершение", ЭтотОбъект, Контекст);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("Заголовок", НСтр("ru = 'Сброс признака обработки отсканированных штрихкодов'"));
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДлительнаяОперация = СброситьПризнакОбработкиНаСервере(ПараметрыСбросаПризнакаОбработки);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СброситьПризнакОбработкиНаСервере(ПараметрыСбросаПризнакаОбработки)
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.СброситьПризнакОбработки",
		ПараметрыСбросаПризнакаОбработки, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура СброситьПризнакОбработкиЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	ИначеЕсли Результат.Статус <> "Выполнено" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат сброса признака обработки.'"));
	Иначе
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Признак обработки сброшен.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
